title: FIM - rc.local (/etc/rc.local)
id: 51010c05-192e-5b6d-86a5-1fb257791bea
status: experimental
description: >
  Integrity change on rc.local (/etc/rc.local). Modification/creation/deletion here often indicates tampering, backdooring, or track-covering.
references:
  - https://attack.mitre.org/techniques/T1565/001/
author: DeusWatch (generated)
level: high
logsource:
  product: linux
  category: file_event
detection:
  selection:
    file.path|contains:
      - '/etc/rc.local'
  change:
    event.action:
      - file_modified
      - file_deleted
  condition: selection and change
tags:
  - attack.t1565.001
  - attack.impact
