title: FIM - sudoers drop-in (/etc/sudoers.d/)
id: fbe0a465-8bc5-5af8-bc7b-975c14152a33
status: experimental
description: >
  Integrity change on sudoers drop-in (/etc/sudoers.d/). Modification/creation/deletion here often indicates tampering, backdooring, or track-covering.
references:
  - https://attack.mitre.org/techniques/T1565/001/
author: DeusWatch (generated)
level: critical
logsource:
  product: linux
  category: file_event
detection:
  selection:
    file.path|contains:
      - '/etc/sudoers.d/'
  change:
    event.action:
      - file_created
      - file_modified
      - file_deleted
  condition: selection and change
tags:
  - attack.t1565.001
  - attack.impact
