title: FIM - wifi credentials (/etc/wpa_supplicant/)
id: f894928c-217c-52a2-bc28-cb7659a13a4b
status: experimental
description: >
  Integrity change on wifi credentials (/etc/wpa_supplicant/). Modification/creation/deletion here often indicates tampering, backdooring, or track-covering.
references:
  - https://attack.mitre.org/techniques/T1565/001/
author: DeusWatch (generated)
level: high
logsource:
  product: linux
  category: file_event
detection:
  selection:
    file.path|contains:
      - '/etc/wpa_supplicant/'
  change:
    event.action:
      - file_modified
      - file_deleted
  condition: selection and change
tags:
  - attack.t1565.001
  - attack.impact
