title: FIM (Web) - images dir (php drop) (/images/)
id: eea306d7-f930-54b6-8631-2caefb620ead
status: experimental
description: >
  Integrity change under the web application tree (images dir (php drop): /images/). Watch for webshell drops in upload dirs and tampering of core app files.
references:
  - https://attack.mitre.org/techniques/T1565/001/
author: DeusWatch (generated)
level: medium
logsource:
  product: linux
  category: file_event
detection:
  selection:
    file.path|contains:
      - '/images/'
  change:
    event.action:
      - file_created
      - file_modified
      - file_deleted
  condition: selection and change
tags:
  - attack.t1565.001
  - attack.persistence
