title: FIM - PAM config (/etc/pam.d/)
id: 80c637db-f21a-5cb2-acae-4c8ed874ffbe
status: experimental
description: >
  Integrity change on PAM config (/etc/pam.d/). Modification/creation/deletion here often indicates tampering, backdooring, or track-covering.
references:
  - https://attack.mitre.org/techniques/T1565/001/
author: DeusWatch (generated)
level: critical
logsource:
  product: linux
  category: file_event
detection:
  selection:
    file.path|contains:
      - '/etc/pam.d/'
  change:
    event.action:
      - file_modified
      - file_deleted
  condition: selection and change
tags:
  - attack.t1565.001
  - attack.impact
