title: FIM - DNS resolver (/etc/resolv.conf)
id: af175594-98e9-5312-869b-7521634c1902
status: experimental
description: >
  Integrity change on DNS resolver (/etc/resolv.conf). Modification/creation/deletion here often indicates tampering, backdooring, or track-covering.
references:
  - https://attack.mitre.org/techniques/T1565/001/
author: DeusWatch (generated)
level: medium
logsource:
  product: linux
  category: file_event
detection:
  selection:
    file.path|contains:
      - '/etc/resolv.conf'
  change:
    event.action:
      - file_modified
      - file_deleted
  condition: selection and change
tags:
  - attack.t1565.001
  - attack.impact
