title: FIM - shadow backup (/etc/shadow-)
id: 022d0ec6-4f8d-5534-996e-47c49827c424
status: experimental
description: >
  Integrity change on shadow backup (/etc/shadow-). Modification/creation/deletion here often indicates tampering, backdooring, or track-covering.
references:
  - https://attack.mitre.org/techniques/T1565/001/
author: DeusWatch (generated)
level: critical
logsource:
  product: linux
  category: file_event
detection:
  selection:
    file.path|contains:
      - '/etc/shadow-'
  change:
    event.action:
      - file_modified
      - file_deleted
  condition: selection and change
tags:
  - attack.t1565.001
  - attack.impact
