title: FIM - php.ini (/etc/php.ini)
id: 08ab0575-5f6e-5332-8c04-a085cbacbe7c
status: experimental
description: >
  Integrity change on php.ini (/etc/php.ini). Modification/creation/deletion here often indicates tampering, backdooring, or track-covering.
references:
  - https://attack.mitre.org/techniques/T1565/001/
author: DeusWatch (generated)
level: medium
logsource:
  product: linux
  category: file_event
detection:
  selection:
    file.path|contains:
      - '/etc/php.ini'
  change:
    event.action:
      - file_modified
      - file_deleted
  condition: selection and change
tags:
  - attack.t1565.001
  - attack.impact
