title: FIM - network interfaces (/etc/network/interfaces)
id: 24702b51-626f-5348-8402-1f2c15710245
status: experimental
description: >
  Integrity change on network interfaces (/etc/network/interfaces). Modification/creation/deletion here often indicates tampering, backdooring, or track-covering.
references:
  - https://attack.mitre.org/techniques/T1565/001/
author: DeusWatch (generated)
level: medium
logsource:
  product: linux
  category: file_event
detection:
  selection:
    file.path|contains:
      - '/etc/network/interfaces'
  change:
    event.action:
      - file_modified
      - file_deleted
  condition: selection and change
tags:
  - attack.t1565.001
  - attack.impact
