title: FIM - supervisor config (/etc/supervisor/)
id: b63be94f-cdca-53b3-beb9-8c794e3eeb96
status: experimental
description: >
  Integrity change on supervisor config (/etc/supervisor/). Modification/creation/deletion here often indicates tampering, backdooring, or track-covering.
references:
  - https://attack.mitre.org/techniques/T1565/001/
author: DeusWatch (generated)
level: medium
logsource:
  product: linux
  category: file_event
detection:
  selection:
    file.path|contains:
      - '/etc/supervisor/'
  change:
    event.action:
      - file_created
      - file_modified
      - file_deleted
  condition: selection and change
tags:
  - attack.t1565.001
  - attack.impact
