title: FIM (Web) - Drupal settings (/sites/default/settings.php)
id: ce33309c-b6ed-53bf-b080-fbc74b1efd51
status: experimental
description: >
  Integrity change under the web application tree (Drupal settings: /sites/default/settings.php). Watch for webshell drops in upload dirs and tampering of core app files.
references:
  - https://attack.mitre.org/techniques/T1565/001/
author: DeusWatch (generated)
level: high
logsource:
  product: linux
  category: file_event
detection:
  selection:
    file.path|contains:
      - '/sites/default/settings.php'
  change:
    event.action:
      - file_modified
      - file_deleted
  condition: selection and change
tags:
  - attack.t1565.001
  - attack.persistence
