title: FIM (Windows) - system.ini
id: 70278c0a-5e1a-5032-80e8-bd3ad6f4865a
status: experimental
description: >
  Integrity change on a sensitive Windows path (system.ini: ...\Windows\system.ini). Tampering here is associated with persistence, credential theft, or evasion.
references:
  - https://attack.mitre.org/techniques/T1565/001/
author: DeusWatch (generated)
level: medium
logsource:
  product: windows
  category: file_event
detection:
  selection:
    file.path|contains:
      - '\Windows\system.ini'
  change:
    event.action:
      - file_modified
      - file_deleted
  condition: selection and change
tags:
  - attack.t1565.001
  - attack.impact
