title: Discovery - filesystem secret grep
id: be4c1503-6a14-56fc-b5a7-a00d783ddc0a
status: experimental
description: >
  Command line consistent with filesystem secret grep - typical post-exploitation reconnaissance.
references:
  - https://attack.mitre.org/techniques/T1059/
author: DeusWatch (generated)
level: medium
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    process.command_line|contains:
      - 'grep -r password'
      - 'grep -ri passwd'
      - 'grep -r api_key'
      - 'grep -r secret'
  condition: selection
tags:
  - attack.t1552.001
  - attack.discovery
