title: Windows LOLBin - domain trust discovery
id: 91045e03-acbc-5223-bdbf-70200dca42ce
status: experimental
description: >
  Command line consistent with domain trust discovery, a living-off-the-land technique abusing a signed system binary.
references:
  - https://attack.mitre.org/techniques/T1059/
author: DeusWatch (generated)
level: high
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    process.command_line|contains:
      - 'nltest /domain_trusts'
      - 'nltest /dclist'
      - 'nltest.exe'
  condition: selection
tags:
  - attack.t1482
  - attack.defense_evasion
