title: Linux Abuse - password change
id: ffcbc3c1-17e2-59e5-8ecb-2b87855d1a60
status: experimental
description: >
  Command line consistent with password change - associated with persistence, defense evasion, or impact on Linux hosts.
references:
  - https://attack.mitre.org/techniques/T1059/
author: DeusWatch (generated)
level: high
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    process.command_line|contains:
      - 'passwd root'
      - 'echo root:'
      - 'chpasswd'
      - 'openssl passwd'
  condition: selection
tags:
  - attack.t1098
  - attack.defense_evasion
