title: Judi Online - Slot title/provider '3 kingdoms'
id: 29ae9231-bb9e-504c-9a4a-82623f764264
status: experimental
description: >
  Reference to gambling slot title/provider '3 kingdoms'. Presence in a legitimate asset's content or file names indicates SEO-spam / gambling content injection.
references:
  - https://attack.mitre.org/techniques/T1491/002/
author: DeusWatch (generated)
level: medium
logsource:
  category: web
detection:
  keywords:
    - '3 kingdoms'
  condition: keywords
tags:
  - attack.t1491.002
  - attack.impact
