title: Judi Online - Slot title/provider 'songkran splash'
id: 3a362679-d75b-58b0-bfa2-369153cc39c9
status: experimental
description: >
  Reference to gambling slot title/provider 'songkran splash'. Presence in a legitimate asset's content or file names indicates SEO-spam / gambling content injection.
references:
  - https://attack.mitre.org/techniques/T1491/002/
author: DeusWatch (generated)
level: medium
logsource:
  category: web
detection:
  keywords:
    - 'songkran splash'
  condition: keywords
tags:
  - attack.t1491.002
  - attack.impact
